SURV/src/InformationRegisters/ЗапросНаОтсутствие/ЗапросНаОтсутствие.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЗапросНаОтсутствие</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыЗаявок</types>
    </type>
  </resources>
  <resources>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПользовательПодписант</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидОтсутствия</name>
    <type>
      <types>EnumRef.ВидыВремени</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПериодНачала</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПериодОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

SURV/src/InformationRegisters/УчетРабочегоВремени/УчетРабочегоВремени.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УчетРабочегоВремени</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>ВидВремени</name>
    <type>
      <types>EnumRef.ВидыВремени</types>
    </type>
  </resources>
  <resources>
    <name>ВремяОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Офис</name>
    <type>
      <types>CatalogRef.Офисы</types>
    </type>
  </resources>
  <resources>
    <name>ПользовательПодписант</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <attributes>
    <name>Дверь</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

SURV/src/InformationRegisters/РегламентированныйПроизводственныйКалендарь/РегламентированныйПроизводственныйКалендарь.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РегламентированныйПроизводственныйКалендарь</name>
  <resources>
    <name>Пятидневка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Шестидневка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КалендарныеДни</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВидДня</name>
    <type>
      <types>EnumRef.ВидыДнейПроизводственногоКалендаря</types>
    </type>
  </resources>
  <dimensions>
    <name>Домен</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаКалендаря</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Год</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

SURV/src/Enums/СтатусыЗаявок/СтатусыЗаявок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыЗаявок</name>
  <enumValues>
    <name>Новый</name>
  </enumValues>
  <enumValues>
    <name>Одобрен</name>
  </enumValues>
  <enumValues>
    <name>Отклонен</name>
  </enumValues>
</mdclass:Enum>

SURV/src/Enums/ВидыВремени/ВидыВремени.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыВремени</name>
  <enumValues>
    <name>ЗарегистрированоПоКарте</name>
  </enumValues>
  <enumValues>
    <name>УчестьВсеВремяКакРабочее</name>
  </enumValues>
  <enumValues>
    <name>Отпуск</name>
  </enumValues>
  <enumValues>
    <name>ОтпускБезСохраненияЗП</name>
  </enumValues>
  <enumValues>
    <name>ДополнительныйВыходной</name>
  </enumValues>
  <enumValues>
    <name>Болезнь</name>
  </enumValues>
  <enumValues>
    <name>Командировка</name>
  </enumValues>
  <enumValues>
    <name>МестнаяКомандировка</name>
  </enumValues>
  <enumValues>
    <name>Учеба</name>
  </enumValues>
  <enumValues>
    <name>Личное</name>
  </enumValues>
</mdclass:Enum>

SURV/src/Enums/ВидыДнейПроизводственногоКалендаря/ВидыДнейПроизводственногоКалендаря.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДнейПроизводственногоКалендаря</name>
  <comment>(Общ)</comment>
  <enumValues>
    <name>Рабочий</name>
    <comment>(Общ) Рабочий день</comment>
  </enumValues>
  <enumValues>
    <name>Суббота</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>Воскресенье</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>Предпраздничный</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>Праздник</name>
    <comment>(Общ)</comment>
  </enumValues>
</mdclass:Enum>

SURV/src/InformationRegisters/ЗапросНаОтсутствие/ManagerModule.bsl
&НаСервере
Процедура УстановитьСтатус(КлючЗаписи,Статус,ДопКомментарий = "") Экспорт 
	ТекЗап = РегистрыСведений.ЗапросНаОтсутствие.СоздатьМенеджерЗаписи();
	ТекЗап.Период = КлючЗаписи.Период;
	ТекЗап.Пользователь = КлючЗаписи.Пользователь;
	ТекЗап.ПользовательПодписант = КлючЗаписи.ПользовательПодписант;
	ТекЗап.ВидОтсутствия = КлючЗаписи.ВидОтсутствия;
	ТекЗап.ПериодНачала = КлючЗаписи.ПериодНачала;
	ТекЗап.ПериодОкончания = КлючЗаписи.ПериодОкончания;
	ТекЗап.Прочитать();
	ТекЗап.Статус = ?(Статус = Истина,Перечисления.СтатусыЗаявок.Одобрен,Перечисления.СтатусыЗаявок.Отклонен);
	Если ЗначениеЗаполнено(ДопКомментарий) Тогда 
		ТекЗап.Комментарий = ТекЗап.Комментарий + "
							|"+ДопКомментарий;
	КонецЕсли;
	ТекЗап.Записать(Истина);
КонецПроцедуры

&НаСервере
Процедура ОбновитьДанныеУчетаВремени(КлючЗаписи) Экспорт 
	
	//Если НачалоДня(КлючЗаписи.ПериодНачала) = НачалоДня(КлючЗаписи.ПериодОкончания) Тогда 
	Если КлючЗаписи.ВидОтсутствия = Перечисления.ВидыВремени.ЗарегистрированоПоКарте
		Или КлючЗаписи.ВидОтсутствия = Перечисления.ВидыВремени.УчестьВсеВремяКакРабочее
		Или КлючЗаписи.ВидОтсутствия = Перечисления.ВидыВремени.МестнаяКомандировка
		Или КлючЗаписи.ВидОтсутствия = Перечисления.ВидыВремени.Личное Тогда 
		
		НовЗап = РегистрыСведений.УчетРабочегоВремени.СоздатьМенеджерЗаписи();
		НовЗап.Период = КлючЗаписи.ПериодНачала;
		НовЗап.Пользователь = КлючЗаписи.Пользователь;
		//НовЗап.Офис = ;
		НовЗап.ВидВремени = КлючЗаписи.ВидОтсутствия;
		НовЗап.ВремяОкончания = КлючЗаписи.ПериодОкончания;
		НовЗап.ПользовательПодписант = КлючЗаписи.ПользовательПодписант;
		НовЗап.Записать();
		
	Иначе //если за период
	
		ВремяНачалаРаботы = Константы.НачалоРабочегоДня.Получить();
		ВремяОкончанияРаботы = Константы.КонецРабочегоДня.Получить();
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	РегламентированныйПроизводственныйКалендарь.ДатаКалендаря,
		               |	РегламентированныйПроизводственныйКалендарь.ВидДня
		               |ИЗ
		               |	РегистрСведений.РегламентированныйПроизводственныйКалендарь КАК РегламентированныйПроизводственныйКалендарь
		               |ГДЕ
		               |	РегламентированныйПроизводственныйКалендарь.ДатаКалендаря МЕЖДУ &ДатаНачала И &ДатаОкончания
					   |	И РегламентированныйПроизводственныйКалендарь.Домен = &Домен";
		Запрос.УстановитьПараметр("ДатаНачала",НачалоДня(КлючЗаписи.ПериодНачала));
		Запрос.УстановитьПараметр("ДатаОкончания",КонецДня(КлючЗаписи.ПериодОкончания));
		Запрос.УстановитьПараметр("Домен",КлючЗаписи.Пользователь.Домен);
		ТЗ_ВидыДней = Запрос.Выполнить().Выгрузить();
		
		Для Каждого Стр Из ТЗ_ВидыДней Цикл
			
			Если Стр.ВидДня <> Перечисления.ВидыДнейПроизводственногоКалендаря.Суббота
				И Стр.ВидДня <> Перечисления.ВидыДнейПроизводственногоКалендаря.Воскресенье
				И Стр.ВидДня <> Перечисления.ВидыДнейПроизводственногоКалендаря.Праздник Тогда 
			
				НовЗап = РегистрыСведений.УчетРабочегоВремени.СоздатьМенеджерЗаписи();
				НовЗап.Период = НачалоДня(Стр.ДатаКалендаря) + Число(ВремяНачалаРаботы - '00010101');
				НовЗап.Пользователь = КлючЗаписи.Пользователь;
				//НовЗап.Офис = ;
				НовЗап.ВидВремени = КлючЗаписи.ВидОтсутствия;
				НовЗап.ВремяОкончания = НачалоДня(Стр.ДатаКалендаря) + Число(ВремяОкончанияРаботы - '00010101') - ?(Стр.ВидДня = Перечисления.ВидыДнейПроизводственногоКалендаря.Предпраздничный,60*60,0);
				НовЗап.ПользовательПодписант = КлючЗаписи.ПользовательПодписант;
				НовЗап.Записать();
					
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПодтвердитьЗаявку(КлючЗаписи) Экспорт
	НачатьТранзакцию();
	Попытка
		УстановитьСтатус(КлючЗаписи,Истина);	
		ОбновитьДанныеУчетаВремени(КлючЗаписи);
		ЗафиксироватьТранзакцию();
		Возврат Истина;
	Исключение
		Сообщить(ОписаниеОшибки());
		ОтменитьТранзакцию();
		Возврат Ложь;
	КонецПопытки;
КонецФункции

&НаСервере
Функция ОтклонитьЗаявку(КлючЗаписи,ПричинаОтказа = "") Экспорт 
	НачатьТранзакцию();
	Попытка
		УстановитьСтатус(КлючЗаписи,Ложь,"ПРИЧИНА ОТКАЗА: "+?(ЗначениеЗаполнено(ПричинаОтказа),ПричинаОтказа,"<не указана>"));
		ЗафиксироватьТранзакцию();
		Возврат Истина;
	Исключение
		Сообщить(ОписаниеОшибки());
		ОтменитьТранзакцию();
		Возврат Ложь;
	КонецПопытки;
КонецФункции

&НаСервере
Функция ОтменитьЗаявку(КлючЗаписи) Экспорт 
	ТекЗап = РегистрыСведений.ЗапросНаОтсутствие.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(ТекЗап,КлючЗаписи);
	ТекЗап.Прочитать();
	Если ТекЗап.Выбран() Тогда 
		Если ТекЗап.Статус <> Перечисления.СтатусыЗаявок.Новый Тогда 
			Возврат Ложь;
		Иначе
			Попытка
        		ТекЗап.Удалить();
				Возврат Истина;
			Исключение
				Возврат Ложь;
			КонецПопытки;
		КонецЕсли;
	КонецЕсли;
КонецФункции
